Feature: Самый догорой смартфон это SAMSUNG Galaxy Note 20 Ultra 256Gb

  @smoke
  Scenario: Самый догорой смартфон это SAMSUNG Galaxy Note 20 Ultra 256Gb
    Given открываю главную страницу магазина citilink
    When нажимаю на кнопку "Каталог товаров"
    And перехожу на страницу каталога смартфонов
    And ставлю сортировку сначала дорогие
    And выставляю фильтр по производителю "Samsung"
    And выставляю фильтр по оперативной памяти "8 ГБ"
    And принимаю все значения фильтров
    And открываю первый товар из списка в новом окне
    Then заголовок страницы соответсвует ожидаемому